docs: update flow and diagrams
